{"data":{"markdownRemark":{"html":"<ul>\n<li>3 tablespoons butter</li>\n<li>½ cup cold milk</li>\n<li>2 tablespoons sugar</li>\n<li>¼ teaspoon salt</li>\n<li>1 large egg</li>\n<li>2 teaspoons dry yeast</li>\n<li>1 ½ cups plus ¼ cup all purpose flour</li>\n<li>1 egg white</li>\n</ul>\n<p>Heat the butter in a large heavy pot. Turn off the heat.</p>\n<p>Add the milk, sugar, and salt. Mix well with a wooden spoon until thoroughly dissolved.</p>\n<p>Crack the egg, add to the mixture and mix well. Add the dry yeast and let it all sit for 1 minute.</p>\n<p>Add 1 ½ cups flour and mix well with the wooden spoon (or rice scoop) for about 1 minute. The dough will be very sticky.</p>\n<p>Cover the pot and let it rise for 1 hour until it doubles in size.</p>\n<p>Deflate and knead the dough by hand for 1 to 2 minutes and cover again. Let it rise for 30 minutes.</p>\n<p>Deflate and fold the dough for another minute until it makes a smooth dough ball.</p>\n<p>Place the ¼ cup flour on the cutting board and sprinkle with some flour. Transfer the dough ball to a dusted cutting board and divide into 6 equal size pieces.</p>\n<p>Rub a piece of dough between your hands until it forms into a cylinder. Put it on the dusted cutting board and roll it out with both hands until it’s about 8 inch in length. Coil it around itself and bring the end from the bottom up and over to the top of the coil so you can insert it into the center. The dough is very soft and sticky. When you shape the rolls, dust your fingers with some flour so the rolls don’t stick to them. Put it on a non stick baking pan (I used 7 x 8 inch pan in the video).</p>\n<p>Repeat with the remaining dough pieces. Be sure to leave enough room in between the rolls for them to expand.</p>\n<p>Let it rise for 1 hour.</p>\n<p>Preheat oven to 180 °C for 5 minutes. Gently brush the rolls with the egg white and bake for 15 to 17 minutes until light golden brown.</p>\n<p>Brush the remaining egg white onto the rolls. Bake another minute.</p>\n<p>Remove it from the oven and serve hot.</p>","frontmatter":{"title":"Korean Bread Rolls","source":"http://www.maangchi.com/recipe/bread-rolls","related":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/korean-bread-rolls/"}}