{"data":{"markdownRemark":{"html":"<ul>\n<li>\n<p>Chicken</p>\n<ul>\n<li>1 medium chicken (1.5-1.7kg)</li>\n<li>2 cloves garlic</li>\n<li>1 red chilli, deseeded</li>\n<li>2 tbsp jerk seasoning</li>\n<li>1 tsp allspice</li>\n<li>2 tbsp runny honey</li>\n<li>1 tbsp tomato puree</li>\n<li>2 tbsp olive oil</li>\n<li>1 tbsp lime zest</li>\n<li>2 tbsp unsalted butter</li>\n</ul>\n</li>\n<li>\n<p>Rice</p>\n<ul>\n<li>450 ml chicken stock</li>\n<li>100 ml coconut milk</li>\n<li>300 g white rice</li>\n<li>400 g tin of kidney beans, drained</li>\n</ul>\n</li>\n<li>\n<p>To Serve</p>\n<ul>\n<li>1 fresh red chilli</li>\n</ul>\n</li>\n</ul>\n<p>Preheat the oven to 180ºC.</p>\n<p>Peel and mince the garlic. Finely chop the chilli. Throw the jerk seasoning,\nallspice, honey, tomato purée, garlic, chilli and olive oil into a bowl and mix well.</p>\n<p>Lay out the chicken onto the chopping board, breast side down. Use a large\nknife or sharp pair of scissors to firmly cut down either side of the backbone,\nthen pull it out at the remaining joint and away from the bird. Turn the bird over\nand you should now be able to flatten it on the board.</p>\n<p>Save 3 tablespoons of the jerk mix then run the rest all over and inside the\nchicken. Poke several holes in the meat with a skewer to help the flavour\npenetrate the bird as it cooks. Season the chicken with the zest of the limes\n(then save the limes), salt and pepper.</p>\n<p>Preheat a frying pan over a medium heat, then add the butter and let it melt and\nfoam. Place the chicken into the pan, breast side down, and leave it to cook for\na few minutes, until the skin is starting to blacken. Turn the chicken over and\ncook for another 10 minutes over a medium heat.</p>\n<p>Wash the rice under running water until it runs clear and scatter the rice and\ndrained kidney beans into a deep baking dish. Pour over the chicken stock,\ncoconut milk and the saved jerk mix then stir everything together. Put a wire rack\nover the top of the baking dish. Lay out the chicken over the wire rack so that\nthe juices drip into the rice. Transfer the pan to the oven and roast for 30-40\nminutes to finish cooking the chicken and to let the rice absorb all of the liquid.\nCheck the chicken is cooked by poking a skewer into the thickest part and\nmaking sure the juices run clear.</p>\n<p>Leave to rest for 15 minutes once cooked, then fluff up the rice with a fork and\nserve the two together. Quarter the lime and slice the red chilli to garnish and dig\nin!</p>","frontmatter":{"title":"Jerk Chicken","serves":"4","source":"https://sortedfood.com/recipe/14160"},"fields":{"relatedRecipes":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/jerk_chicken/"}}