{"data":{"markdownRemark":{"html":"<ul>\n<li>\n<p>For The Flatbread </p>\n<ul>\n<li>3 c unbleached all-purpose flour </li>\n<li>1 ½ tsp baking powder </li>\n<li>¾ tsp salt </li>\n<li>3 Tbsp olive oil </li>\n<li>½ c warm water </li>\n<li>6 Tbsp warm milk </li>\n</ul>\n</li>\n</ul>\n<p>In a large bowl, combine the flour, baking powder, and salt. Mix together. </p>\n<p>Add olive oil and mix until evenly crumbly. Make a well in the middle of the flour and add the warm water and milk.</p>\n<p>Mix with your hands (or with a fork) until the dough comes together into a dough that is soft, but not sticky. (If necessary, add a little more water to get the dough to come together nicely.) Turn the dough out onto a clean work surface and knead for 5-7 minutes until it is soft and smooth. Divide the dough into 6, roughly even, pieces. Roll each piece into a ball and place the balls to rest on a flour-dusted surface covered with a damp tea towel for 30 minutes Close to the end of resting time, heat your griddle or 10 inch cast iron skillet. Working with one ball at a time, roll the dough into a disc roughly 9 inches in diameter.</p>\n<p>(The flatbreads should be about 2 mm thick.) Gently place the dough onto the hot griddle. Cook the bread over a medium heat for 2-3 minutes on each side, until lightly golden but still pliable, pricking any bubbles that appear with a fork. Remove the flatbread from the griddle and wrap it in a clean tea towel if you’d like to continue cooking the remaining dough. (Once all the dough is cooked, you can add your fillings as desired and grill to heat the bread and fillings as described below.) Or, add your sandwich fixings to the flatbread while it is on the griddle and fold the piadine into a half moon around the fillings. </p>\n<p>Heat the sandwich on the griddle for 2-4 minutes until the fillings are warm and the cheese is melty. Serve immediately.</p>","frontmatter":{"title":"Piadina","source":"https://www.curiouscuisiniere.com/piadina/","related":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/piadina/"}}