{"data":{"markdownRemark":{"html":"<ul>\n<li>\n<p>Na marinádu na maso:</p>\n<ul>\n<li>500 g kuřecích prsou</li>\n<li>1 kelímek bílého jogurtu</li>\n<li>1 lžíce nastrouhaného zázvoru</li>\n<li>1 lžíce prolisovaného česneku</li>\n<li>1 lžička římského mletého kmínu</li>\n<li>1 lžíce koření tandoori masala</li>\n<li>sůl</li>\n</ul>\n</li>\n<li>\n<p>Na omáčku:</p>\n<ul>\n<li>lžíce oleje (ne olivový)</li>\n<li>1 velká cibule</li>\n<li>2 rajčata</li>\n<li>1 lžíce nastrouhaného zázvoru</li>\n<li>1 lžíce prolisovaného česneku</li>\n<li>1 lžička kurkumy</li>\n<li>1 lžička římského mletého kmínu</li>\n<li>1 lžička indického kari</li>\n<li>1 kousek celé skořice</li>\n<li>1 kardamon</li>\n<li>2 hvězdičky badyánu</li>\n<li>4 bobkové listy</li>\n<li>150 ml smetany ke šlehání (31%)</li>\n<li>1 plechovka krájených rajčat</li>\n<li>hrst čerstvého koriandru</li>\n<li>sůl, cukr</li>\n<li>(čerstvá chilli paprička)</li>\n</ul>\n</li>\n</ul>\n<p>Nejdřív jsem připravila marinádu na maso. Maso jsem nakrájela na větší kostky (asi 4×4 cm) a pak jsem v misce smíchala všechny ostatní ingredience s jogurtem. Do takhle připravený směsi jsem naložila maso a misku jsem zabalila do potravinový fólie. Ideální je, když je maso naložený přes noc, ale minimálně mu dejte dvě hodiny.</p>\n<p>Omáčku jsem připravila tak, že na lžíci rozpálenýho oleje jsem dozlatova osmažila najemno nakrájenou cibuli (asi 5 minut) a přidala k ní zázvor, česnek, mletej římskej kmín, kurkumu a indický kari. Všechno jsem nechala spolu tak dvě minuty restovat. Pak jsem přidala na kostičky nakrájený rajčata, skořici, kardamon, badyán, bobkovej list, plechovku rajčat, smetanu a sůl. Kdo má rád pálivý, přidá ještě svoji oblíbenou chilli papričku. Všechno jsem nechala společně povařit asi 15 minut, ochutnala jsem a podle chuti jsem přidala cukr a sůl. Když jsem omáčku dochutila, vyndala jsem bobkovej list, kardamon, badyán a skořici.</p>\n<p>Maso naložený v marinádě jsem naskládala na plech, kterej jsem vyložila pečícím papírem. Troubu jsem předehřála na 250 °C a maso jsem pekla do měkka asi deset minut. Maso musí zůstat šťavnatý, tak ho kontrolujte a nepřepečte. Já po deseti minutách vyndala jeden kousek a rozřízla ho. Podle toho se řídím. Hotový maso jsem přidala do omáčky i se šťávou, která z masa vytekla a nechala jsem společně ještě dvě minutky provařit.</p>\n<p>Chleba je jednoduchej. Do mísy jsem nasypala mouku s kypřícím práškem, trochu jsem ji osolila (asi půl lžičky) a přilila jsem smetanu. Promíchala jsem a pak jsem po troškách přidávala vodu, dokud mi nevzniklo kompaktní těsto. To by nemělo lepit, aby se z něj daly vyválet placky. Pokud lepí, přidávám mouku. Pokud se sype, přidávám vodu. Těsto jsem rozdělila na pět částí a každou jsem vyválela na tenkou placku. Placky jsem dala na plech vyloženej pečícím papírem, propíchala jsem je trošku vidličkou a na nejvyšší stupeň v troubě jsem je pekla asi 3 minuty, dokud se nenafouky a nezhnědly. Hotový placky jsem potřela máslem a posypala sezamem.</p>","frontmatter":{"title":"Chicken Tikka Masala","source":"http://www.mycookingdiary.cz/recept/kureci-tikka-masala/","related":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/tikka-masala/"}}