{"data":{"markdownRemark":{"html":"<ul>\n<li>1 tbsp oil</li>\n<li>1 large onion</li>\n<li>1 red pepper</li>\n<li>2 garlic cloves, peeled</li>\n<li>1 heaped tsp hot chilli powder (or 1 level tbsp if you only have mild)</li>\n<li>1 tsp paprika</li>\n<li>1 tsp ground cumin</li>\n<li>500g lean minced beef</li>\n<li>1 beef stock cube</li>\n<li>400g can chopped tomatoes</li>\n<li>½ tsp dried marjoram</li>\n<li>1 tsp sugar</li>\n<li>2 tbsp tomato purée</li>\n<li>410g can red kidney beans</li>\n<li>plain boiled long grain rice, to serve</li>\n<li>soured cream, to serve</li>\n</ul>\n<p>Prepare your vegetables. Chop 1 large onion into small dice, about 5mm square. Cut 1 red pepper in half lengthways, remove stalk and wash the seeds away, then chop. Peel and finely chop 2 garlic cloves.</p>\n<p>Start cooking. Put your pan on the hob over a medium heat. Add the onions and cook for about 5 minutes. Tip in the garlic, red pepper, 1 heaped tsp hot chilli powder or 1 level tbsp mild chilli powder, 1 tsp paprika and 1 tsp ground cumin. Give it a good stir, then leave it to cook for another 5 minutes, stirring occasionally.</p>\n<p>Brown the 500g lean minced beef. Turn the heat up a bit, add the meat to the pan and break it up with your spoon or spatula. The mix should sizzle a bit when you add the mince. Keep stirring and prodding for at least 5 minutes, until all the mince is in uniform, mince-sized lumps and there are no more pink bits. Make sure you keep the heat hot enough for the meat to fry and become brown, rather than just stew.</p>\n<p>Making the sauce. Crumble 1 beef stock cube into 300ml hot water. Pour this into the pan with the mince mixture. Open 1 can of chopped tomatoes (400g can) and add these as well. Tip in ½ tsp dried marjoram and 1 tsp sugar, if using (see tip at the bottom), and add a good shake of salt and pepper. Squirt inabout 2 tbsp tomato purée and stir the sauce well.</p>\n<p>Simmer it gently. Bring the whole thing to the boil, give it a good stir and put a lid on the pan. Turn down the heat until it is gently bubbling and leave it for 20 minutes. You should check on the pan occasionally to stir it and make sure the sauce doesn’t catch on the bottom of the pan or isn’t drying out. If it is, add a couple of tablespoons of water and make sure that the heat really is low enough. After simmering gently, the saucy mince mixture should look thick, moist and juicy.</p>\n<p>Bring on the beans. Drain and rinse 1 can of red kidney beans (410g can) in a sieve and stir them into the chilli pot. Bring to the boil again, and gently bubble without the lid for another 10 minutes, adding a little more water if it looks too dry. Taste a bit of the chilli and season. It will probably take a lot more seasoning than you think. Now replace the lid, turn off the heat and leave your chilli to stand for 10 minutes before serving, and relax. Leaving your chilli to stand is really important as it allows the flavours to mingle and the meat.</p>","frontmatter":{"date":null,"title":"Chilli con Carne"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/chilli-con-carne/"}}