{"data":{"markdownRemark":{"html":"<ul>\n<li>4cm piece of ginger</li>\n<li>4 cloves of garlic</li>\n<li>1 bunch of spring onions</li>\n<li>2 fresh red chillies</li>\n<li>40g cashew nuts</li>\n<li>4 kaffir lime leaves</li>\n<li>1 teaspoon ground turmeric</li>\n<li>2 teaspoons fish sauce</li>\n<li>300g oyster mushrooms</li>\n<li>1 ripe mango</li>\n<li>3 x 200g skinless free-range chicken breasts</li>\n<li>olive oil</li>\n<li>500g fine green beans</li>\n<li>2 limes</li>\n<li>1 x 400ml tin of light coconut milk</li>\n<li>450g basmati rice</li>\n<li>250g purple kale</li>\n<li>2 sticks of lemongrass</li>\n</ul>\n<p>Peel the ginger and garlic, trim the spring onions, halve and deseed 1 chilli, then char and soften it all in a large casserole pan on a medium-high heat with the cashews until everything is just starting to catch, tossing often. Tip into a blender with the lime leaves, turmeric, fish sauce, 1 teaspoon of black pepper and a pinch of sea salt and blitz into a paste.</p>\n<p>Return the pan to a medium heat and dry char the mushrooms for 5 minutes so they get dark golden and nutty. Cut the cheeks off the mango and peel, then cut both the mango and chicken breasts into 1cm slices. Remove the mushrooms to a plate, then add 1 tablespoon of oil and the paste to the pan. Stir and fry for 1 minute to get the flavours going, then add the chicken and mango and stir-fry for 5 minutes. Halve the green beans and add to the pan, returning the mushrooms, too. Squeeze in the juice of 1 lime, pour in the coconut milk, swirl a splash of water around the empty tin and pour into the pan. Bring to the boil, then simmer for 10 minutes, or until slightly thickened, stirring occasionally. Taste and season to perfection. Meanwhile, cook the rice in a large pan of boiling salted water according to the packet instructions. Pull the kale leaves off the stalks, tear into small pieces, and chuck into the rice pan after 5 minutes to cook through and add colour.</p>\n<p>Whack the sticks of lemongrass on your work surface to crush them, then remove the tough outer layer. Halve and deseed the remaining chilli and chop super-finely with the lemongrass. Drain the rice and serve with the curry, with a sprinkle of lemongrass and chilli, to your taste, and with lime wedges on the side, for squeezing over.</p>","frontmatter":{"title":"Balinese Chicken Curry","serves":null,"source":"http://www.jamieoliver.com/recipes/curry-recipes/balinese-chicken-curry/"},"fields":{"relatedRecipes":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/balinese-chicken-curry/"}}