{"data":{"markdownRemark":{"html":"<ul>\n<li>2 chicken breasts (or 1 full breast if attached), diced to 1\" cubes, seasoned with salt and pepper</li>\n<li>1 large onion, diced</li>\n<li>1 bell pepper, bunch of asparagus, or other veg, diced</li>\n<li>2½ cups arborrio rice</li>\n<li>2 packages beef or chicken stock, lower sodium is best (2x 14 oz box- you may use less or have to add additional broth or water to cook to your preferred rice texture. I like beef in this even though its a chicken dish because its a bit saltier and has a richer flavor when cooked down, but that is just a personal preference)</li>\n<li>3 tbsp butter</li>\n<li>olive oil</li>\n<li>salt</li>\n<li>pepper</li>\n<li>diced green onions or peas- ¼ cup</li>\n<li>dry vermouth, optional- ½ cup</li>\n<li>1 cup water</li>\n<li>Parmesan Cheese, optional</li>\n</ul>\n<p>Add diced chicken to 1 tbsp of olive oil.</p>\n<p>Cook until browned on all sides.</p>\n<p>Add diced vegetables.</p>\n<p>When vegetables are slightly browned, add butter and stir.</p>\n<p>Lower heat to medium-low, add rice, stir well.</p>\n<p>Let rice brown just slightly (think \"toasted\" for a little flavor)</p>\n<p>Add a little bit of stock and vermouth (optional!!)- just enough to keep the consistency liquid.</p>\n<p>Stir frequently until rice thickens.</p>\n<p>Add a little more stock until it is just barely liquid. Repeat stirring frequently until thickened and adding just enough stock to keep it from burning or becoming too thick.</p>\n<p>Realistically, using a regular sized container of stock, you'll use it in about 6ths or 8ths.</p>\n<p>When your stock is gone, and the risotto has become thicker, taste a bit of it.</p>\n<p>If the rice is too crunchy for your taste, add a little water and proceed with the steps above. Risotto should be slightly al dente- just a slight, teeny crunch when bit. If you over cook the rice, it will become a bit gummy- but its all individual tastes.</p>\n<p>Add diced green onions just before your risotto is done cooking- you won't want them to overcook. If using frozen peas, add them with the last addition of stock so they thaw and cook just briefly.</p>\n<p>When risotto is thick enough to not spread all over a plate, but not so thick you can shape it like mashed potatoes, it is ready.</p>\n<p>Grate fresh parmesan cheese over the top and enjoy!</p>","frontmatter":{"title":"Risotto","source":"https://sweetcsdesigns.com/one-pot-chicken-risotto/"},"fields":{"relatedRecipes":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/risotto/"}}