{"data":{"markdownRemark":{"html":"<ul>\n<li>775 grams all-purpose flour</li>\n<li>12 grams salt</li>\n<li>180 grams starter (flour + water + yeast)</li>\n<li>510 ml luke-warm water</li>\n<li>Olive oil</li>\n<li>Mozzarella cheese</li>\n<li>Feta cheese (Greek or Bulgarian)</li>\n<li>Eggs</li>\n</ul>\n<p>Mix equal amounts of flour and water (one cup each) and yeast (dry or fresh yeast). You need 1 tablespoon of yeast for each cup of flour.</p>\n<p>Cover the mixture and place it in your refrigerator for 24 hours.</p>\n<p>You can use the starter the next day when it is ready. If you have any leftover you can store it in the fridge for 1 year.</p>\n<p>In this recipe, you will need 180 grams of starter.</p>\n<p>Mix the flour, salt, starter, and water in a large bowl, using your hand.</p>\n<p>You do not need to knead the dough. Just mix all the ingredients together until you get a ball. If the dough is too sticky, add a bit of flour to make it easy for you to roll the dough.</p>\n<p>Grease the bottom and sides of a container with a little bit of olive oil.\nPlace the dough in a container, cover, and let it rest in a warm place for 24 hours.</p>\n<p>The next day the dough is ready. It is elastic, soft, and ready to be shaped!</p>\n<p>Make 150 grams balls of dough, sprinkle with flour if needed to make the shaping easy.</p>\n<p>Cover the dough balls until you need to use them.</p>\n<p>Grate the mozarella cheese and break the feta cheese. In a bowl, mix equal amount of both cheeses.</p>\n<p>Preheat your oven to 425 °F degrees (220 °C degrees).</p>\n<p>Roll a dough ball (150 grams) by hand or using a rolling pin until you get a long rectangle.</p>\n<p>Roll the long edges of the dough rectangle to create an elevation, then pinch the sides of the dough to shape the dough in a boat form.</p>\n<p>Add a heaping amount of cheese mixture to the center of the \"boat\".</p>\n<p>Note: You can shape the dough \"boat\" in a baking pan directly, so you don't loose the shape when transferring it from your work station to the baking pan.</p>\n<p>Bake the khachapuri for 4-5 minutes until the cheese melts.</p>\n<p>Once the cheese has melted, remove the khachapuri from the oven, and gently break an egg in the center. Make sure not to break the egg yolk when breaking the egg - it needs to stay whole.</p>\n<p>Return the khachapuri to the oven and bake for another 2-3 minutes.</p>","frontmatter":{"date":"January 01, 2019","path":"/recipe/adjarski","title":"My first blog post"}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}