{"data":{"markdownRemark":{"html":"<ul>\n<li>\n<p>Choux pastry</p>\n<ul>\n<li>125 ml milk</li>\n<li>200 ml water</li>\n<li>150 g plain flour</li>\n<li>1 teaspoon golden caster sugar</li>\n<li>½ teaspoon salt</li>\n<li>100 g unsalted butter</li>\n<li>4 medium eggs lightly beaten</li>\n<li>Chantilly cream</li>\n<li>1½ vanilla pod split</li>\n<li>300 ml whipping cream</li>\n<li>1½ tablespoons icing sugar</li>\n</ul>\n</li>\n<li>\n<p>Chocolate sauce</p>\n<ul>\n<li>200 g good quality dark chocolate 70% cocoa solids</li>\n<li>30 g unsalted butter</li>\n<li>3 tablespoons clear honey</li>\n<li>125 ml full fat milk</li>\n</ul>\n</li>\n<li>\n<p>2 ½ cups of flour</p>\n</li>\n<li>\n<p>½ teaspoon salt</p>\n</li>\n<li>\n<p>½ tablespoon baking powder</p>\n</li>\n<li>\n<p>½ tablespoon sugar</p>\n</li>\n<li>\n<p>1 large egg</p>\n</li>\n<li>\n<p>¾ cups warm water</p>\n</li>\n<li>\n<p>Vegetable oil</p>\n</li>\n<li>\n<p>Semolina</p>\n</li>\n</ul>\n<h1>Preparing the Dough:</h1>\n<p>You will need 2 ½ cups of all-purpose flour. Add ½ teaspoon of salt, ½ tablespoon of baking powder, ½ tablespoon of sugar, and 1 large egg. Mix all the ingredients using your hand. Now, start adding warm water a little by little until your form a ball with the dough. For this amount of flour, you will need ¾ cup of warm water, but this will depend on the quality of absorption of the flour your are using. Important tip, add the water little by little while working the dough with your hand, so you don’t put too much. You need just enough water for the dough to form a ball; however, it wont be too moist and it should definitely not be sticky. If you put too much water, just add a little flour to balance it.</p>\n<p>Place the dough on your kitchen counter and knead it with the palms of your hands. The movements have to be fast and energetic. Knead the dough for around 5 minutes. You will notice that the dough will become moist, smooth, and elastic.</p>\n<p>Once the dough is ready, brush it with vegetable oil. Grasp a portion of the dough, and using your thumb and index fingers, cut small dough balls that are a little bigger than the size of ping pong balls. From time to time, put vegetable oil on your hands to keep them well oiled while cutting the dough.</p>\n<p>Place the dough balls in a plate, cover them with foil or napkin, and let them rest for 15 minutes.</p>\n<h1>Shaping the Dough:</h1>\n<p>After 15 minutes, the dough balls are ready to be shaped into squares, which is the traditional shape of Msemmen.</p>\n<p>Brush your kitchen counter with vegetable oil. Take a dough ball and fatten it with the palm of your hand. Using your fingers, gently push the edges of the dough to expand it into a very thin disk of dough – the dough is almost transparent at this point and you can somewhat see your kitchen counter through it.</p>\n<p>Sprinkle a little bit of semolina of the thin disk of dough. Fold the upper edge and lower edge of the dough toward the center on top of the other edge, to create a long rectangle of dough. Sprinkle with semolina again, then fold the right and left edges of the dough towards the center, on top of each other, to form a square.</p>\n<p>Place the dough squares on a plate, cover them, and let them rest for 15 minutes.</p>\n<h1>Cooking the Msemmen:</h1>\n<p>This is the last step. When the dough is ready, brush your kitchen counter with vegetable oil, take one dough square and flatten it with your fingers and the palm of your hand, until you get a thin square that is around 3 times larger.</p>\n<p>To cook the msemmen, first heat your pan on high heat and once ready drizzle some vegetable oil on it. Reduce the heat to medium-high and cook the msemmen on both sides for a few minutes each, turning over several times until each side has a golden brown color and the center of the smemmen is cooked. The msemmen may puff up while cooking, but will immediately become flat if you push it down with your hand. The cooked msemmen is chewy but should not taste raw.</p>\n<p>Once the msemmen is cooked, place it on paper towels to absorb excess oil.</p>\n<p>And that’s it, serve the msemmen immediately, with honey, cheese, or any other toppings of your choice. Here is mine, served with honey and rolled the Moroccan way. Look how soft, chewy, and flaky it is... all I need now is my Moroccan mint tea.</p>\n<p>If you want to keep your msemmen, just warp it with foil and place it in your freezer for up to 1 month. You just need to heat it in your pan before serving.</p>","frontmatter":{"title":"Msemmen","source":"http://cookingwithalia.com/msemmen-moroccan-pancake/"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/msemmen/"}}