{"data":{"markdownRemark":{"html":"<ul>\n<li>\n<p>Choux pastry</p>\n<ul>\n<li>125 ml milk</li>\n<li>200 ml water</li>\n<li>150 g plain flour</li>\n<li>1 teaspoon golden caster sugar</li>\n<li>½ teaspoon salt</li>\n<li>100 g unsalted butter</li>\n<li>4 medium eggs lightly beaten</li>\n<li>Chantilly cream</li>\n<li>1½ vanilla pod split</li>\n<li>300 ml whipping cream</li>\n<li>1½ tablespoons icing sugar</li>\n</ul>\n</li>\n<li>\n<p>Chocolate sauce</p>\n<ul>\n<li>200 g good quality dark chocolate 70% cocoa solids</li>\n<li>30 g unsalted butter</li>\n<li>3 tablespoons clear honey</li>\n<li>125 ml full fat milk</li>\n</ul>\n</li>\n</ul>\n<p>Preheat the oven to 200 °C. Sift the flour and salt into a bowl. Place the milk, cold water, salt, sugar into a pan and set over a low heat. Once the sugar and salt has dissolved add the butter. Once the butter has melted, bring to a rolling boil. Turn off the heat then tip in the flour and beat vigorously with a wooden spoon. As soon as the mixture starts to come away from the side of the pan, stop beating and tip onto a plate to cool.</p>\n<p>Return the mixture to the pan, then gradually beat in the eggs, a little at a time, mixing well between each addition, until you have a smooth paste. (Alternatively, transfer the mix to an electric mixer and gradually add the eggs while the mixer is running on a low setting).</p>\n<p>Line a baking sheet with greaseproof paper. Spoon the choux pastry into a piping bag fitted with a large plain nozzle (about 1.5cm in diameter). Pipe a small blob of the pastry mix under each corner of the greaseproof to keep the paper in place. Now pipe about 20 walnut-sized balls onto the baking sheet, spaced well apart. Level the peaked tops with the tip of a wet finger then bake for 18-20 minutes until well risen and golden brown.</p>\n<p>Remove from the oven and transfer to a wire rack to cool completely before filling.</p>\n<p>For the Chantilly cream scrape the seeds from the vanilla pod into a large mixing bowl. Add the cream, and icing sugar then whisk together until the consistency of a soft meringue with floppy peaks. Spoon the cream into a clean piping bag, fitted with a small plain nozzle. Pierce the base of a choux bun with the tip of the nozzle and pipe in the cream. Repeat with the remaining choux buns.</p>\n<p>For the chocolate sauce, break the chocolate into small pieces in a heatproof bowl. Place the bowl over a pan of simmering water and heat. Add the butter and honey stirring from time to time, until the chocolate begins to melt. Gradually whisk in the milk until you have a smooth sauce and warm through. Serve the cream-filled profiteroles with the hot chocolate sauce drizzled over.</p>","frontmatter":{"date":null,"title":"Profiteroles","source":"http://www.lifestylefood.com.au/recipes/2057/profiteroles-with-hot-chocolate-sauce"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/profiteroles/"}}